# YOLOv8 with ResNet50 Backbone
nc: 80  # number of classes
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# ResNet50 Backbone 정의
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 7, 2, 3]]  # ResNet50의 초기 Conv 레이어
  - [-1, 1, Bottleneck, [64, 64, 256, 1, True]]  # ResNet50 블록 시작
  - [-1, 3, Bottleneck, [256, 128, 4, False]]    # 추가 ResNet 블록
  - [-1, 4, Bottleneck, [512, 256, 6, False]]    # 더 큰 블록
  - [-1, 6, Bottleneck, [1024, 512, 3, False]]   # 최종 블록
  - [-1, 1, SPPF, [1024, 5]]  # YOLOv8에서 사용되는 SPPF (Spatial Pyramid Pooling Fast)

# YOLOv8 Head (변경 없이 유지)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]  # P4 레이어와의 Concat
  - [-1, 3, C2f, [512]]  # C2f 블록
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]  # P3 레이어와의 Concat
  - [-1, 3, C2f, [256]]  # P3/8-small
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]  # P4 레이어와의 Concat
  - [-1, 3, C2f, [512]]  # P4/16-medium
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]  # P5 레이어와의 Concat
  - [-1, 3, C2f, [1024]]  # P5/32-large
  - [[15, 18, 21], 1, Detect, [nc]]  # 최종 Detect 레이어
